---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteEditPointsClipped
source: html/33ad4b6d-3b3f-53dc-82ee-87491bc91d8e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteFailures.SiteEditPointsClipped Property

Portions of the topographic surface or points on the surface may not be visible in this view due to clipping by the view.

## Syntax (C#)
```csharp
public static FailureDefinitionId SiteEditPointsClipped { get; }
```